

province_list = (
    (1, "河北省"), (2, "山东省"), (3, "辽宁省"), (4, "黑龙江省"), (5, "吉林省"),
    (6, "甘肃省"), (7, "青海省"), (8, "河南省"), (9, "江苏省"), (10, "湖北省"),
    (11, "湖南省"), (12, "江西省"), (13, "浙江省"), (14, "广东省"), (15, "云南省"),
    (16, "福建省"), (17, "台湾省"), (18, "海南省"), (19, "山西省"), (20, "四川省"),
    (21, "陕西省"), (22, "贵州省"), (23, "安徽省"), (24, "重庆市"), (25, "北京市"),
    (26, "上海市"), (27, "天津市"), (28, "广西壮族自治区"), (29, "内蒙古自治区"), (30, "西藏自治区"),
    (31, "新疆维吾尔自治区"), (32, "宁夏回族自治区"), (33, "澳门特别行政区"), (34, "香港特别行政区")
)

province_dictionary = {}
for item in province_list:
    province_dictionary[item[0]] = item[1]


